/*
*******************************************************************************
*                     《手把手教你学51单片机(C语言版)》
*                    配套 KST-51 单片机开发板 示例源代码
*
*         (c) 版权所有 2014 金沙滩工作室/清华大学出版社 保留所有权利
*                 获取更多资料请访问：http://www.kingst.org
*
* 文件名：Infrared.h
* 描  述：采用NEC编码协议的红外遥控驱动模块的头文件
* 版本号：v1.0.0
* 备  注：
*******************************************************************************
*/

#ifndef _INFRARED_H
#define _INFRARED_H


#ifndef _INFRARED_C

#endif

void InitInfrared();
void InfraredDriver();

#endif
